In [1]:
mysql://stu1900013002:stu1900013002@162.105.146.37:43306

In [2]:
show databases;

,Database
0,dataset
1,information_schema
2,stu1900013002

In [3]:
use stu1900013002;

In [7]:
show tables;

,Tables_in_stu1900013002
0,my_stock
1,trans

In [16]:
create table my_stock
(
    stock_id int not null,
    volume int,
    avg_price float,
    profit float,
    primary key (stock_id)
);

In [15]:
drop table my_stock;

In [18]:
create table my_trans
(
    trans_id int not null,
    stock_id int not null,
    tdate int,
    price float,
    amount int,
    sale_or_by char(1),
    primary key (trans_id),
    check (sale_or_by = 'S' or sale_or_by='B')
);

In [17]:
drop table my_trans;

In [19]:
select * from my_stock;

In [20]:
select * from my_trans;

In [21]:
show triggers;

In [22]:
insert into my_trans values (1,1,1,10,1000,"B");
select * from my_stock;

,stock_id,volume,avg_price,profit
0,1,1000,10.0,0.0

In [23]:
insert into my_trans values (2,1,2,11,500,"B");
select * from my_stock;

,stock_id,volume,avg_price,profit
0,1,1500,10.3333,0.0

In [ ]:
insert into trans values (3,1,3,12,800,"S");
select * from my_stock;

In [ ]:
insert into my_trans values (4,1,4,12,1000,"S");
select * from my_stock;

In [ ]:
insert into my_trans values (5,1,5,9,1000,"B");
select * from my_stock;

In [ ]:
insert into my_trans values (6,1,6,12,800,"S");
select * from my_stock;

In [ ]:
insert into my_trans values (7,1,7,7,800,"S");
select * from my_stock;

In [ ]:
delete from my_stock;
delete from trans;